
<table>
<tr>
<td width=15%><img src="./img/UGA.png"></img></td>
<td><center><h1>Introduction to Python for Data Sciences</h1></center></td>
<td width=15%><a href="http://www.iutzeler.org" style="font-size: 16px; font-weight: bold">Franck Iutzeler</a><br/> Fall. 2018 </td>
</tr>
</table>

<br/><br/><div id="top"></div>

<center><a style="font-size: 40pt; font-weight: bold">Chap. 3 - Data Handling with Pandas </a></center>

<br/>

# ``2. Dataframes``

---

<a href="#style"><b>Package check and Styling</b></a><br/><br/><b>Outline</b><br/><br/>
&nbsp;&nbsp;&nbsp; a) <a href="#dataOp"> Operations</a><br/>&nbsp;&nbsp;&nbsp; b) <a href="#dataApp"> Appending, Concatenating, and Merging</a><br/>&nbsp;&nbsp;&nbsp; c) <a href="#dataPre"> Preparing the Data</a><br/>&nbsp;&nbsp;&nbsp; d) <a href="#dataBase"> Basic Statistics </a><br/>&nbsp;&nbsp;&nbsp; e) <a href="#dataGroup"> GroupBy </a><br/>&nbsp;&nbsp;&nbsp; f) <a href="#dataExo"> Exercises  </a><br/>

## <a id="dataOp"> a) Operations</a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

In [1]:
import numpy as np
import pandas as pd

### Numpy operations


If we apply a NumPy function on a Pandas datframe, the result will be another Pandas dataframe with the indices preserved.

In [86]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  5  6  5  4
1  8  7  5  8
2  4  9  3  0

In [37]:
np.cos(df * np.pi/2 ) - 1

     A    B    C    D
0 -2.0 -2.0  0.0 -1.0
1  0.0 -2.0  0.0 -1.0
2  0.0 -1.0 -1.0 -1.0

### Arithmetic operations

Arithmetic operations can also be performed either with <tt>+ - / *</tt> or with dedicated <tt>add multiply</tt> etc methods

In [74]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)), columns=list('AB'))
A

   A  B
0  1  1
1  6  3

In [75]:
B = pd.DataFrame(np.random.randint(0, 10, (3, 3)), columns=list('BAC'))
B

   B  A  C
0  2  3  4
1  3  0  8
2  0  5  0

In [76]:
A+B

     A    B   C
0  4.0  3.0 NaN
1  6.0  6.0 NaN
2  NaN  NaN NaN

The pandas arithmetic functions also have an option to fill missing values by replacing the missing one in either of the dataframes by some value.

In [77]:
A.add(B, fill_value=0.0)

     A    B    C
0  4.0  3.0  4.0
1  6.0  6.0  8.0
2  5.0  0.0  0.0

## <a id="dataApp"> b) Appending, Concatenating, and Merging</a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>


Thanks to naming, dataframes can be easily added, merged, etc. However, if some entries are missing (columns or indices), the operations may get complicated. Here the most standard situations are covered, take a look at the documentation (notably [this one on merging, appending, and concatenating](https://pandas.pydata.org/pandas-docs/stable/merging.html) )

* **Appending** is for adding the lines of one dataframe with another one with the same columns.

In [54]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)), columns=list('AB'))
A2 = pd.DataFrame(np.random.randint(0, 20, (3, 2)), columns=list('AB'))
print("A:\n",A,"\nA2:\n",A2)

A:
     A   B
0  10   2
1  12  12
A2:
     A  B
0   3  4
1  15  3
2   2  1

In [55]:
A.append(A2) # this does not "append to A" but creates a new dataframe

    A   B
0  10   2
1  12  12
0   3   4
1  15   3
2   2   1

Sometimes, indexes do not matter, they can be resetted using <tt>ignore_index=True</tt>.

In [56]:
A.append(A2,ignore_index=True)

    A   B
0  10   2
1  12  12
2   3   4
3  15   3
4   2   1

* **Concatenating** is for adding lines and/or columns of multiples datasets (it is a generalization of appending)

In [59]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)), columns=list('AB'))
A2 = pd.DataFrame(np.random.randint(0, 20, (3, 2)), columns=list('AB'))
A3 = pd.DataFrame(np.random.randint(0, 20, (1, 3)), columns=list('CAD'))
print("A:\n",A,"\nA2:\n",A2,"\nA3:\n",A3)

A:
    A   B
0  2   7
1  5  11
A2:
     A   B
0   7  13
1   7  14
2  10  17
A3:
    C   A  D
0  1  19  0

The most important settings of the <tt>concat</tt> function are <tt>pd.concat(objs, axis=0, join='outer',ignore_index=False)</tt> where <br/>
. *objs* is the list of dataframes to concatenate <br/>
. *axis* is the axis on which to concatenate 0 (default) for the lines and 1 for the columns <br/>
. *join* is to decide if we keep all columns/indices on the other axis ('outer' ,default), or the intersection ( 'inner') <br/>
. *ignore_index* is to decide is we keep the previous names (False, default) or give new ones (True)


For a detailed view see  [this doc on merging, appending, and concatenating](https://pandas.pydata.org/pandas-docs/stable/merging.html)

In [61]:
pd.concat([A,A2,A3],ignore_index=True)

    A     B    C    D
0   2   7.0  NaN  NaN
1   5  11.0  NaN  NaN
2   7  13.0  NaN  NaN
3   7  14.0  NaN  NaN
4  10  17.0  NaN  NaN
5  19   NaN  1.0  0.0

In [62]:
pd.concat([A,A2,A3],axis=1)

     A     B   A   B    C     A    D
0  2.0   7.0   7  13  1.0  19.0  0.0
1  5.0  11.0   7  14  NaN   NaN  NaN
2  NaN   NaN  10  17  NaN   NaN  NaN

In [64]:
pd.concat([A,A2,A3],axis=1,ignore_index=True,join='inner')

   0  1  2   3  4   5  6
0  2  7  7  13  1  19  0

* **Merging** is for putting together two dataframes with *hopefully* common data


For a detailed view see  [this doc on merging, appending, and concatenating](https://pandas.pydata.org/pandas-docs/stable/merging.html)

In [78]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [79]:
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [81]:
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [82]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [83]:
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

## <a id="dataPre"> c) Preparing the Data</a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>


Before exploring the data, it is primordial to verify its soundness, indeed if it has missing or replicated data, the results of our test may not be accurate. Pandas provides a collection of methodes to verify the sanity of the data (recall that when data is missing for an entry, it is noted as <tt>NaN</tt>, and thus any further operation including this will be <tt>NaN</tt>). 


To explore some typical problems in a dataset, I messed with a small part of the [*MovieLens*](https://grouplens.org/datasets/movielens/) dataset. The <tt>ratings_mess.csv</tt> file contains 4 columns:
* <tt>userId</tt> id of the user, integer greater than 1 
* <tt>movieId</tt>  id of the user, integer greater than 1 
* <tt>rating</tt> rating of the user to the movie, float between 0.0 and 5.0  
* <tt>timestamp</tt> timestamp, integer 

and features (man-made!) errors, some of them minor some of them major.

In [128]:
ratings = pd.read_csv('data/ml-small/ratings_mess.csv')
ratings.head(7) # enables to display the top n lines of a dataframe, 5 by default

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0           NaN
3     2.0     52.0    83.0  8.353560e+08
4     NaN     62.0     3.0  8.353557e+08
5     2.0    144.0     NaN  8.353560e+08
6     0.0    616.0     3.0  8.353559e+08

### Missing values


Pandas provides functions that check if the values are missing:

* ``isnull()``: Generate a boolean mask indicating missing values
* ``notnull()``: Opposite of ``isnull()``

In [129]:
ratings.isnull().head(5)

   userId  movieId  rating  timestamp
0   False    False   False      False
1   False    False   False      False
2   False    False   False       True
3   False    False   False      False
4    True    False   False      False

#### Carefully pruning data

Now that we have to prune lines of our data, this will be done using ``dropna()`` through <tt>dataframe.dropna(subset=["col_1","col_2"],inplace=True)</tt> which drops all rows with at least one missing value in the columns <tt>col1, col2</tt> of <tt>dataframe</tt> *in place* that is without copy.


<div class="warn"> <b>Warning:</b> this function deletes any line with at least **one** missing data, which is not always wishable. Also, with *inplace=True*, it is applied in place, meaning that they modify the dataframe it is applied to, it is thus an **irreversible operation**; drop *inplace=True* to create a copy or see the result before apllying it.</div>

For instance here, <tt>userId,movieId,rating</tt> are essential whereas the <tt>timestamp</tt> is not (it can be dropped for the prediciton process). Thus, we will delete the lines where one of <tt>userId,movieId,rating</tt> is missing and fill the <tt>timestamp</tt> with 0 when it is missing.

In [130]:
ratings.dropna(subset=["userId","movieId","rating"],inplace=True)
ratings.head(5)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0           NaN
3     2.0     52.0    83.0  8.353560e+08
6     0.0    616.0     3.0  8.353559e+08

To fill missing data (from a certain column), the recommended way is to use ``fillna()`` through <tt>dataframe["col"].fillna(value,inplace=True)</tt> which replace all missing values in the column <tt>col</tt> of <tt>dataframe</tt> by <tt>value</tt> *in place* that is without copy (again this is irreversible, to use the copy version use inplace=False).

In [131]:
ratings["timestamp"].fillna(0,inplace=True)
ratings.head(7)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0     52.0    83.0  8.353560e+08
6     0.0    616.0     3.0  8.353559e+08
8     2.0    720.0     4.0  8.353560e+08
9     3.0     60.0     3.0  1.298862e+09

This indeed gives the correct result, however, the line indexing presents missing number. The indexes can be resetted with  <tt>reset_index(inplace=True,drop=True)</tt>

In [132]:
ratings.reset_index(inplace=True,drop=True)
ratings.head(7)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0     52.0    83.0  8.353560e+08
4     0.0    616.0     3.0  8.353559e+08
5     2.0    720.0     4.0  8.353560e+08
6     3.0     60.0     3.0  1.298862e+09

### Improper values

Even without the missing values, some lines are problematic as they feature values outside of prescribed range (<tt>userId</tt> id of the user, integer greater than 1; <tt>movieId</tt>  id of the user, integer greater than 1; <tt>rating</tt> rating of the user to the movie, float between 0.0 and 5.0; <tt>timestamp</tt> timestamp, integer )

In [133]:
ratings[ratings["userId"]<1]  # Identifying a problem

   userId  movieId  rating    timestamp
4     0.0    616.0     3.0  835355932.0

Now, we drop the corresponding line, with ``drop`` by <tt>drop(problematic_row.index, inplace=True)</tt>. 

<div class="warn"> **Warning:** Do not forget <tt>.index</tt> and <tt>inplace=True</tt></div>

In [134]:
ratings.drop(ratings[ratings["userId"]<1].index, inplace=True)
ratings.head(7)

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0     52.0    83.0  8.353560e+08
5     2.0    720.0     4.0  8.353560e+08
6     3.0     60.0     3.0  1.298862e+09
7     3.0    110.0     4.0  1.298922e+09

In [135]:
pb_rows = ratings[ratings["movieId"]<1]
pb_rows

    userId  movieId  rating     timestamp
12     3.0      0.0     3.0  1.298924e+09
24     4.0     -1.0     2.0  9.499822e+08

In [136]:
ratings.drop(pb_rows.index, inplace=True)

And finally the ratings.

In [137]:
pb_rows = ratings[ratings["rating"]<0]
pb_rows2 = ratings[ratings["rating"]>5]
tot_pb_rows = pb_rows.append(pb_rows2 )
tot_pb_rows

    userId  movieId  rating     timestamp
15     3.0   2858.0    -4.0  1.298922e+09
3      2.0     52.0    83.0  8.353560e+08
25     5.0   3176.0   123.5  1.163374e+09
29     6.0    111.0     6.0  1.109258e+09

In [138]:
ratings.drop(tot_pb_rows.index, inplace=True)
ratings.reset_index(inplace=True,drop=True)

We finally have our dataset cured! Let us save it for further use.

<tt>to_csv</tt> saves as CSV into some file, <tt>index=False</tt> drops the index names as we did not specify it.

In [139]:
ratings.to_csv("data/ml-small/ratings_cured.csv",index=False)

## <a id="dataBase"> d) Basic Statistics </a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

With our cured dataset, we can begin exploring.

In [144]:
ratings = pd.read_csv('data/ml-small/ratings_cured.csv')
ratings.head()

   userId  movieId  rating     timestamp
0     1.0     31.0     2.5  1.260759e+09
1     1.0   1029.0     3.0  1.260759e+09
2     2.0     10.0     4.0  0.000000e+00
3     2.0    720.0     4.0  8.353560e+08
4     3.0     60.0     3.0  1.298862e+09

The following table summarizes some other built-in Pandas aggregations:

| Aggregation              | Description                     |
|--------------------------|---------------------------------|
| ``count()``              | Total number of items           |
| ``first()``, ``last()``  | First and last item             |
| ``mean()``, ``median()`` | Mean and median                 |
| ``min()``, ``max()``     | Minimum and maximum             |
| ``std()``, ``var()``     | Standard deviation and variance |
| ``mad()``                | Mean absolute deviation         |
| ``prod()``               | Product of all items            |
| ``sum()``                | Sum of all items                |

These are all methods of ``DataFrame`` and ``Series`` objects, and ``description`` also provides a quick overview.

In [145]:
ratings.describe()

          userId       movieId     rating     timestamp
count  24.000000     24.000000  24.000000  2.400000e+01
mean    3.416667   2465.916667   4.020833  1.056019e+09
std     1.212854   6171.507686   0.926414  3.610777e+08
min     1.000000     10.000000   2.000000  0.000000e+00
25%     3.000000    213.250000   3.375000  9.498962e+08
50%     3.000000   1028.500000   4.000000  1.163375e+09
75%     4.000000   1628.000000   5.000000  1.298862e+09
max     6.000000  30749.000000   5.000000  1.298923e+09

We see that these statistics do not make sense for all rows. Let us drop the timestamp and examine the ratings.

In [146]:
ratings.drop("timestamp",axis=1,inplace=True)
ratings.head()

   userId  movieId  rating
0     1.0     31.0     2.5
1     1.0   1029.0     3.0
2     2.0     10.0     4.0
3     2.0    720.0     4.0
4     3.0     60.0     3.0

In [147]:
ratings["rating"].describe()

count    24.000000
mean      4.020833
std       0.926414
min       2.000000
25%       3.375000
50%       4.000000
75%       5.000000
max       5.000000
Name: rating, dtype: float64

## <a id="dataGroup"> e) GroupBy </a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

These ratings are linked to users and movies, in order to have a separate view per user/movie, *grouping* has to be used.

The ``GroupBy`` operation (that comes from SQL) accomplishes:

- The *split* step involves breaking up and grouping a ``DataFrame`` depending on the value of the specified key.
- The *apply* step involves computing some function, usually an sum, median, means etc *within the individual groups*.
- The *combine* step merges the results of these operations into an output array.

<img src="img/GroupBy.png">
<p style="text-align: right">Source: [Python Data Science Handbook](http://shop.oreilly.com/product/0636920034919.do) by Jake VanderPlas</p>

In [149]:
ratings.head()

   userId  movieId  rating
0     1.0     31.0     2.5
1     1.0   1029.0     3.0
2     2.0     10.0     4.0
3     2.0    720.0     4.0
4     3.0     60.0     3.0

So to get the mean of the ratings per user, the command is

In [153]:
ratings.groupby("userId")["rating"].mean()

userId
1.0    2.750000
2.0    4.000000
3.0    3.444444
4.0    5.000000
5.0    4.166667
6.0    4.500000
Name: rating, dtype: float64

### Filtering

Filtering is the action of deleting rows depending on a boolean function. For instance, the following removes the user with a rating of only one movie.

In [156]:
ratings.groupby("userId")["rating"].count()

userId
1.0    2
2.0    2
3.0    9
4.0    7
5.0    3
6.0    1
Name: rating, dtype: int64

In [159]:
def filter_func(x):
    return x["rating"].count() >= 2

filtered = ratings.groupby("userId").filter(filter_func)
filtered

    userId  movieId  rating
0      1.0     31.0     2.5
1      1.0   1029.0     3.0
2      2.0     10.0     4.0
3      2.0    720.0     4.0
4      3.0     60.0     3.0
5      3.0    110.0     4.0
6      3.0    247.0     3.5
7      3.0    592.0     3.0
8      3.0    593.0     3.0
9      3.0    595.0     2.0
10     3.0   2762.0     3.5
11     3.0   2841.0     4.0
12     3.0   2959.0     5.0
13     4.0     34.0     5.0
14     4.0    112.0     5.0
15     4.0   1028.0     5.0
16     4.0   1030.0     5.0
17     4.0   1079.0     5.0
18     4.0   1089.0     5.0
19     4.0   1097.0     5.0
20     5.0   4447.0     4.5
21     5.0   4718.0     3.5
22     5.0  30749.0     4.5

In [160]:
filtered.groupby("userId")["rating"].count()

userId
1.0    2
2.0    2
3.0    9
4.0    7
5.0    3
Name: rating, dtype: int64

### Transformations

Transforming is the actions of applying a transformation (sic).

For instance, let us normalize the ratings so that they have zero mean for each user.

In [167]:
ratings.groupby("userId")["rating"].mean()

userId
1.0    2.750000
2.0    4.000000
3.0    3.444444
4.0    5.000000
5.0    4.166667
6.0    4.500000
Name: rating, dtype: float64

In [168]:
def center_ratings(x):
    x["rating"] = x["rating"] - x["rating"].mean()
    return x

centered = ratings.groupby("userId").apply(center_ratings)

In [183]:
centered.groupby("userId")["rating"].mean()

userId
1.0    0.000000e+00
2.0    0.000000e+00
3.0   -1.973730e-16
4.0    0.000000e+00
5.0   -2.960595e-16
6.0    0.000000e+00
Name: rating, dtype: float64

#### Another method using lambda calculus [*]

In [182]:
centered = pd.DataFrame(ratings)
centered["rating"] = centered.groupby("userId")["rating"].transform(lambda x:x-x.mean())

### Aggregations [*]

Aggregations let you aggreagate several operations.

In [179]:
ratings.groupby("userId")["rating"].aggregate([min,max,np.mean,np.median,len])

        min  max      mean  median  len
userId
1.0     2.5  3.0  2.750000    2.75  2.0
2.0     4.0  4.0  4.000000    4.00  2.0
3.0     2.0  5.0  3.444444    3.50  9.0
4.0     5.0  5.0  5.000000    5.00  7.0
5.0     3.5  4.5  4.166667    4.50  3.0
6.0     4.5  4.5  4.500000    4.50  1.0

## <a id="dataExo"> f) Exercises  </a> 

<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

<div class="exo"> **Exercise 3.2.1:** Bots Discovery<br/><br/>


In the dataset <tt>ratings_bots.csv</tt>, some users may be bots. To help a movie sucess they add ratings (faborable ones often). To get a better recommendation, we try to remove them by

<ul>
<li> Deleting all users with a mean rating above 4.7/5 (nobody is that nice) and count them. <br/>
* **hint:** the [nunique](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.nunique.html)  function may be helpful to count*</li>
<li> Deteting multiples reviews of movie by a single user by replacing them with only the first one. As it is a strange behavior, add a column "potential_bot" with a boolean flag True for them and False for the other. What is the proportion of potential bots amongst the users? <br/> 
* **hint:** the <tt>groupby</tt> function can be applied to several columns, also <tt>reset_index(drop=True)</tt> removes the grouby indexing.* <br/> 
* **hint:** remember the <tt>loc</tt> function, e.g.  <tt>df.loc[df['userId'] == 128]</tt> returns a dataframe of the rows where the userId is 128; and <tt>df.loc[df['userId'] == 128].loc[samerev['movieId'] == 3825]</tt> returns a dataframe of the rows where the userId is 128 **and** the movieID is 3825.* <br/> 
* **hint:** 17 ratings have to be removed, for instance, user 128 has 3 ratings of the movie 3825.*</li>
</ul>

This dataset has around 100 000 ratings so hand picking won't do!

</div>

In [22]:
import pandas as pd
import numpy as np

ratings_bots = pd.read_csv('data/ml-small/ratings_bots.csv')

<div class="exo"> **Exercise 3.2.2:** Planets discovery <br/><br/>

We will use the Planets dataset, available via the [Seaborn package](http://seaborn.pydata.org/) (see further). It provides information on how astronomers found new planets around stars, *exoplanets*.


<ul>
<li>Diplay median, mean and quantile informations for these planets orbital periods, masses, and distances.</li>
<li>For each method, display statistic on the years planets were discovered using this technique.</li>
<li>Display a table giving the number of planets discovered by each methods in each decade (1980s to 2010s)<br/>
* **hint:** the decade can be obtained as series with <tt>10 (planets['year'] // 10)</tt> and this series can be used in a groupby operation on the dataframe even though it is not a column.*</li>
</ul>

</div>

In [88]:
import pandas as pd
import numpy as np

planets = pd.read_csv('data/planets.csv')
print(planets.shape)
planets.head()

(1035, 6)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

---
<div id="style"></div>
### Package Check and Styling


<p style="text-align: right; font-size: 10px;"><a href="#top">Go to top</a></p>

In [ ]:
import lib.notebook_setting as nbs

packageList = ['IPython', 'numpy', 'scipy', 'matplotlib', 'cvxopt', 'pandas', 'seaborn', 'sklearn', 'tensorflow']
nbs.packageCheck(packageList)

nbs.cssStyling()